{"data":{"allStrapiArticle":{"edges":[{"node":{"id":"Article_1","title":"diffie, hellman and their protocol","published":"April 27th, 2019","author":{"id":2},"categories":[{"id":1,"name":"cryptography"},{"id":2,"name":"public-key cryptography"}],"translations":[{"id":1,"language":"en","title":"Diffie, Hellman and their protocol","description":"One of the most important key exchange protocol","content":"This problem was one of the most important problems of the XX century. Before it was solved, people had to convey keys on a sheet of paper as during the Second World War. In 1976 breakthrough happened when an American cryptographer Whitfield Diffie together with his colleague, professor of Stanford University, Martin Hellman published key exchange scheme which later became known as **the Diffie-Hellman protocol**. Actually, neither Alice nor Bob doesn't transmit a secret key at all, but the key is generated on both sides just by the simple mathematical trick. This absolutely brilliant and simple solution made a real revolution in the world of encryption and launched a whole direction in cryptography called asymmetric cryptography (or public-key cryptography). So how can Alice and Bob get the same keys without passing them to each other?"},{"id":2,"language":"ru","title":"Диффи, Хеллман и их протокол","description":"Один из наиболее важных протоколов","content":"Допустим, два человека (обычно в книгах это Элис и Боб, в русском варианте пускай это будут Оля и Петя) захотели установить секретную переписку друг с другом. Для этого им нужно договориться о секретном ключе, которым они будут зашифровывать и расшифровывать сообщения. Допустим также, что Оля и Петя находятся далеко друг от друга и не могут непосредственно передать друг другу секретный ключ так, чтобы никто не увидел, т.е. они могут послать его лишь по небезопасному каналу связи. Каким же образом передать ключ так, чтобы его никто не смог украсть и подменить?\n\nЭта проблема была одной из главных проблем криптографии XX века, и до её решения людям приходилось передавать ключи, например, на листе бумаги (как во времена Второй Мировой). Прорыв случился в 1976 году, когда американский криптограф Диффи совместно со своим коллегой, профессором стэндфордского университета, Хеллманом, опубликовали схему обмена ключами, которую позже назвали протоколом Диффи-Хеллмана. По сути, в этом протоколе никакой секретный ключ и не передается между Олей и Петей, а путем нехитрых математических манипуляций этот ключ генерируется на обеих сторонах. Это по истине гениальное и простое решение произвело настоящую революцию в мире шифрования и дало старт целому направлению в криптографии, называемому асимметричным шифрованием (или шифрованием с открытым ключом). Как же Оля и Петя могут получить одинаковые ключи, не передавая их друг другу?"}]}},{"node":{"id":"Article_2","title":"functional programmin in JS","published":"April 19th, 2019","author":{"id":2},"categories":[],"translations":[]}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}